{"keras_version": "1.2.0", "class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"trainable": true, "name": "lambda_1", "batch_input_shape": [null, 32, 32, 3], "output_shape": null, "arguments": {}, "function_type": "lambda", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\u001e<ipython-input-4-589d72f3b79a>\u00da\b<lambda>\u0003\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "output_shape_type": "raw", "input_dtype": "float32"}}, {"class_name": "Convolution2D", "config": {"trainable": true, "W_regularizer": null, "nb_row": 5, "nb_col": 5, "b_regularizer": null, "bias": true, "init": "glorot_uniform", "subsample": [1, 1], "name": "convolution2d_1", "activation": "relu", "dim_ordering": "tf", "b_constraint": null, "W_constraint": null, "nb_filter": 6, "activity_regularizer": null, "border_mode": "valid"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "name": "maxpooling2d_1", "pool_size": [2, 2], "dim_ordering": "tf", "border_mode": "valid", "strides": [2, 2]}}, {"class_name": "Convolution2D", "config": {"trainable": true, "W_regularizer": null, "nb_row": 5, "nb_col": 5, "b_regularizer": null, "bias": true, "init": "glorot_uniform", "subsample": [1, 1], "name": "convolution2d_2", "activation": "relu", "dim_ordering": "tf", "b_constraint": null, "W_constraint": null, "nb_filter": 16, "activity_regularizer": null, "border_mode": "valid"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "name": "maxpooling2d_2", "pool_size": [2, 2], "dim_ordering": "tf", "border_mode": "valid", "strides": [2, 2]}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"trainable": true, "W_regularizer": null, "output_dim": 128, "b_regularizer": null, "bias": true, "init": "glorot_uniform", "name": "dense_1", "activation": "relu", "W_constraint": null, "b_constraint": null, "input_dim": 400, "activity_regularizer": null}}, {"class_name": "Dense", "config": {"trainable": true, "W_regularizer": null, "output_dim": 64, "b_regularizer": null, "bias": true, "init": "glorot_uniform", "name": "dense_2", "activation": "relu", "W_constraint": null, "b_constraint": null, "input_dim": 128, "activity_regularizer": null}}, {"class_name": "Dense", "config": {"trainable": true, "W_regularizer": null, "output_dim": 2, "b_regularizer": null, "bias": true, "init": "glorot_uniform", "name": "dense_3", "activation": "softmax", "W_constraint": null, "b_constraint": null, "input_dim": 64, "activity_regularizer": null}}]}