{"class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"function_type": "lambda", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\u001e<ipython-input-4-589d72f3b79a>\u00da\b<lambda>\u0003\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "batch_input_shape": [null, 32, 32, 3], "input_dtype": "float32", "output_shape_type": "raw", "name": "lambda_1", "arguments": {}, "output_shape": null, "trainable": true}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "init": "glorot_uniform", "bias": true, "name": "convolution2d_1", "nb_filter": 6, "trainable": true, "W_constraint": null, "nb_row": 5, "dim_ordering": "tf", "nb_col": 5, "subsample": [1, 1], "b_constraint": null, "border_mode": "valid", "activity_regularizer": null, "W_regularizer": null, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "tf", "name": "maxpooling2d_1", "strides": [2, 2], "border_mode": "valid", "trainable": true, "pool_size": [2, 2]}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "init": "glorot_uniform", "bias": true, "name": "convolution2d_2", "nb_filter": 16, "trainable": true, "W_constraint": null, "nb_row": 5, "dim_ordering": "tf", "nb_col": 5, "subsample": [1, 1], "b_constraint": null, "border_mode": "valid", "activity_regularizer": null, "W_regularizer": null, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "tf", "name": "maxpooling2d_2", "strides": [2, 2], "border_mode": "valid", "trainable": true, "pool_size": [2, 2]}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"b_regularizer": null, "bias": true, "name": "dense_1", "trainable": true, "W_constraint": null, "input_dim": 400, "output_dim": 128, "b_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "W_regularizer": null, "activation": "relu"}}, {"class_name": "Dense", "config": {"b_regularizer": null, "bias": true, "name": "dense_2", "trainable": true, "W_constraint": null, "input_dim": 128, "output_dim": 64, "b_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "W_regularizer": null, "activation": "relu"}}, {"class_name": "Dense", "config": {"b_regularizer": null, "bias": true, "name": "dense_3", "trainable": true, "W_constraint": null, "input_dim": 64, "output_dim": 2, "b_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "W_regularizer": null, "activation": "softmax"}}], "keras_version": "1.2.0"}